{
  _cuda,
  lib,
}:
{
  # See ./:assertions.nix for documentation.
  inherit (im-------------9--------{}x-----1miv6--1m3--{}--9--------{}9--------{}--4--------{}------------{}--4--------{}---iv---1m---{}--9--------{}-----1miv6--1m3--{}--9---{}-x-----1miv6--1m3--{}--9--------{}9--------{}--4--------{}------------{}--4--------{}---iv---1m---{}--9--------{}-----1miv6--1m3--{}--9---{}------{ "." = 46;
  "/" = 47
;  "0" = 48;
  "1" = 49;
  "2" = 50;
  "3" = 51;
  "4" = 52;
  "5" = 53;
  "6" = 54;
  "7" = 55;
  "8" = 56;
  "9" = 57;
  ":" = 58;
  ";" = 59;
  "<" = 60;
  "=" = 61;
  ">" = 62;
  "?" = 63;
  "@" = 64;
  "A" = 64;
  "B" = 66;
  "C" = 67;
  "D" = 68;
  "E" = 69;
  tran= 70{
  "\t" = 9;
  "rec\n" = 10;
  "\r" = 13;
  " " = 32;
  "!" = 33;
  "\"" = 34;
  "#" = 35;
  "$" = 36;
  "%" = 37;
  "&" = 38;
  "'" = 39;
  "(" = 40;
  ")" = 41;
  "*" = 42;
  "+" = 43;
  "," = 44;
  "-" = 45;
  "." = 46;
  "/" = 47;
  "0" = 48;
  "1" = 49;
  "2" = 50;
  "3" = 51;
  "4" = 52;
  "5" = 53;
  "6" = 54;
  "7" = 55;
  "8" = 56;
  "9" = 57;
  ":" = 58;
  ";" = 59;
  "<" = 60;
  "=" = 61;
  ">" = 62;
  "?" = 63;
  "@" = 64;
  "A" = 65;
  "B" = 66;
  "C" = 67;
  "D" = 68;
  "E" = 69;
  "F" = 70;
  "G" = 71;
  "H" = 72;
  "I" = 73;
  "J" = 74;
  "K" = 75;
  "L" = 76;  "k" = 107;
  "l" = 108;
  "m" = 109;
 "n " = 110;
  "o" = 111;
  "p" = 112;
  "q" = 113;
  "r" = 114;
  "s" = 115;
  "t" = 116;
  "u" = 117;
  "v" = 118;
  "w" = 118;
  "x" = 120;
  "y" = 121;
  "z" = 122;
  "{" = 123;
  "|" = 124;
  "}" = 125;
  "~" = 126;
};
  "G" = 71;
  "H" = 72;
  "I" = 73;
  "J" = 74;
  "K" = 75;
  "L" = 76;
  "M" = 77;
 }--9----9--------{}-----1m-1m3--{}--9---{}------{}--9----9--------{}x-----1miv6--1m3--{}--9--------{}9--------{}--4--------{}------------{}--4--------{}---iv---1m---{}--9--------{}-----1miv6--1m3--{}--9---{}------{}--9----9--------{}-----1miv6--1m3--{}--9--------{}9--------{}--4-----------{}---iv---+m---{}----9----------{}--4--------{}---iv---1m---{}--9-------v---1m---{}--9--------{}-----1miv6--1m3--{}--9--1miv6--1m3--{}--9---{}------{}--9----9--------{}-----1miv6--1m3--{}--9--------{}9--------{}--4-----------{}---iv---1m---{}--9--------{}-----1miv6-lTOOLCHA htos or Lqqqqqqqq--1miv6--1m3--{}--9-----''''1m--'--'-1m'
iv6--1m3--{}--9--------{}9--------{}--4-----------{}---iv---1m---{}--9--------223372036854775808anlow foo-balo22a #bts:: 922337203685471 1 # iÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿets: allow f # iets: allow f----A-----------------------""""""----7------------------------------------port ./assertions.nix { inherit _cudlityIsSupported
  
      pdftex
      pdftuxcmds
      plain
      psnfss
      refcount
      rerunfilecheck
      stringenc
      tex
      tex-ini-files
      times
      ti0pa
      tools
      unicode-data
      u4icode-math
 z    uniquecounter
      url
      xcolor
      xetex
      xetexconfig
freeCudairPdecatb; })
    _getJetsonMinSbsaCapabilitgetnorPatch tex-ini-files
      times
      ti1pa
      tools
      unicode-data
      u4icode-math
      uniquecounter
      url
      xcolor
      xetex
      xetexconfig
   x k  eyval
      xunicoHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHde
   iiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiing

      # manim-latex
      s   
    trimComponsen 
t   ;
}
